Обработки/Reports/_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	// Параметры по умолчанию
	
	Отчет.Организация			= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.Период				= Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()) - 1);
	
	// Доступность реквизитов и команд в зависимости от прав
	
	ЭтоПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();
	
	Элементы.Организация.Видимость			= ЭтоПолноправныйПользователь;
	Элементы.ОрганизацияНадпись.Видимость	= Не Элементы.Организация.Видимость;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Отчет.Организация					= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.СчетДоверительногоУправления	= Неопределено;
	
	ПриИзмененииРеквизитовОтчета(Элементы.Организация);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитовОтчета(Элемент)

	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НЕАКТУАЛЬНОСТЬ");
		
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)

	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		РасшифровкаРасчета = СформироватьРасшифровкуРасчета(Расшифровка);
		РасшифровкаРасчета.Показать(СтрШаблон("%1 на %2", Отчет.СчетДоверительногоУправления, Формат(Отчет.Период, "ДФ=dd.MM.yyyy")));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьРасшифровкуРасчета(ДанныеРасчета)
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("Параметр");
	ТаблицаПараметров.Колонки.Добавить("Значение");
	
	Для каждого ПараметрРасчета Из ДанныеРасчета Цикл
		СтрокаПараметра = ТаблицаПараметров.Добавить();
		СтрокаПараметра.Параметр = ПараметрРасчета.Ключ;
		СтрокаПараметра.Значение = ПараметрРасчета.Значение;
	КонецЦикла; 
	
	ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент();
	ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
	
	РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(ПараметрыВывода, ТаблицаПараметров, , , , Истина);
	
	Возврат ПараметрыВывода.ДокументРезультат;
	
КонецФункции
